snlkuharlocal/src/Documents/УстановкаСкидокПоКонтрагентам/УстановкаСкидокПоКонтрагентам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаСкидокПоКонтрагентам</name>
  <registerRecords>InformationRegister.СкидкиНоменклатурыКонтрагентов</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата2</name>
    <comment>Дата окончания действия прайса</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Скидки</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипТовара</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Бренд</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Модель</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаКонечныйПокупатель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/InformationRegisters/СкидкиНоменклатурыКонтрагентов/СкидкиНоменклатурыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СкидкиНоменклатурыКонтрагентов</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.УстановкаСкидокПоКонтрагентам</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/Enums/ВыгружатьНаСайт/ВыгружатьНаСайт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВыгружатьНаСайт</name>
  <enumValues>
    <name>Да</name>
  </enumValues>
  <enumValues>
    <name>Нет</name>
  </enumValues>
  <enumValues>
    <name>КогдаКак</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/УстановкаСкидокПоКонтрагентам/ObjectModule.bsl
//++Данилова Е.В. 23.07.2025 HELP-6121 
Перем ВыгружатьНаСайтb2b_Общ;
Перем ИдентификаторФЗПоАкции; 
//--Данилова Е.В. 23.07.2025
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли; 
	
	НадоПерезаписыватьСкидки	= Ложь;
	ЕстьИзменения				= Модифицированность();
	
	Если НЕ ОбменДанными.Загрузка Тогда
		КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
		МожноЗаписатьДокумент(ЭтотОбъект,Отказ,РежимЗаписи,Истина);
		
		Если Отказ Тогда Возврат КонецЕсли; 	
	КонецЕсли;		
	
	УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	
	// Андреев И.Д.  07.08.2023 начало
	// Шворобей ВЮ 16.10.2023 ++
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТЗ", Контрагенты.Выгрузить());
	Запрос.УстановитьПараметр("ТЗ_Скидки", Скидки.Выгрузить());
	// Шворобей ВЮ 16.10.2023 ++
	
	Запрос.Текст="ВЫБРАТЬ
	             |	ТЗ.Контрагент КАК Контрагент
	             |ПОМЕСТИТЬ ВТ_ТаблицаДанных
	             |ИЗ
	             |	&ТЗ КАК ТЗ
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	ВТ_ТаблицаДанных.Контрагент КАК Контрагент
	             |ПОМЕСТИТЬ НеВнешняяТаблица
	             |ИЗ
	             |	ВТ_ТаблицаДанных КАК ВТ_ТаблицаДанных
				 // Кухарь А.Ю.  22.08.2023 начало
				 | где ВТ_ТаблицаДанных.Контрагент.Ведущий<>&ПустойКонтрагент 
				 | и ВТ_ТаблицаДанных.Контрагент.Владелец=&КолготкиМосква
				 // Кухарь А.Ю.  22.08.2023 конец			 

	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	Контрагенты.Ведущий КАК Ведущий,
	             |	НеВнешняяТаблица.Контрагент КАК Контрагент,
	             |	Контрагенты.Ссылка КАК Ссылка
	             |ПОМЕСТИТЬ ТзСВедущими
	             |ИЗ
	             |	НеВнешняяТаблица КАК НеВнешняяТаблица
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	             |		ПО НеВнешняяТаблица.Контрагент = Контрагенты.Ссылка
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ
	             |	Контрагенты.Ссылка КАК Ссылка
	             |ПОМЕСТИТЬ ТаблицаСоВсемиКонтрагентами
	             |ИЗ
	             |	ТзСВедущими КАК ТзСВедущими
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	             |		ПО ТзСВедущими.Ведущий = Контрагенты.Ведущий
	             |			И (не Контрагенты.НеИспользовать)
	             |			И (не Контрагенты.ПометкаУдаления)
				 | 			и Контрагенты.Владелец=&КолготкиМосква
	             |;
	             |
	             |////////////////////////////////////////////////////////////////////////////////
	             |ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	ЕСТЬNULL(ТаблицаСоВсемиКонтрагентами.Ссылка, &ПустойКонтрагент) КАК Ссылка
	             |ИЗ
	             |	ТаблицаСоВсемиКонтрагентами КАК ТаблицаСоВсемиКонтрагентами
	             |		ПОЛНОЕ СОЕДИНЕНИЕ ВТ_ТаблицаДанных КАК ВТ_ТаблицаДанных
	             |		ПО ТаблицаСоВсемиКонтрагентами.Ссылка = ВТ_ТаблицаДанных.Контрагент
	             |ГДЕ
	             |	ВТ_ТаблицаДанных.Контрагент ЕСТЬ NULL
				 | И не ТаблицаСоВсемиКонтрагентами.Ссылка  ЕСТЬ NULL";

	// Кухарь А.Ю.  22.08.2023 начало
	//
	Запрос.УстановитьПараметр("ПустойКонтрагент",Справочники.Контрагенты.ПустаяСсылка()); 
	запрос.УстановитьПараметр("КолготкиМосква",Справочники.ИБ.НайтиПоКоду("SSP"));
	
	// Кухарь А.Ю.  22.08.2023 конец
	
	РезультатКонтрагенты = Запрос.Выполнить().Выгрузить();
	
	Для каждого СтрТЧ из РезультатКонтрагенты цикл					
		СтрокаДобавить = Контрагенты.Добавить();
		СтрокаДобавить.Контрагент = СтрТЧ.Ссылка;							
	КонецЦикла;
	
	// Шворобей ВЮ 16.10.2023 ++
	//////////////////////////////////////////////////////////////////////////////////////////////////
	
	Запрос.УстановитьПараметр("ТЗ", Контрагенты.Выгрузить());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЗ.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ВТ_ТаблицаДанных
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ТаблицаДанных.Контрагент, Контрагенты.Ссылка) КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаДанных КАК ВТ_ТаблицаДанных
	|		ПО Контрагенты.Ссылка = ВТ_ТаблицаДанных.Контрагент
	|ГДЕ
	|	Контрагенты.Ведущий = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатКонтрагенты = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатКонтрагенты.Количество() > 0 Тогда
		СообщитьИзМодуля("Поле <Ведущий> должно быть заполнено у всех контрагентов");
		
		//Тимофеев Ю.А 24.10.2023
		//а то не понятно у какого контрагента нужно поправить.
		Для каждого стрКонтрагент из РезультатКонтрагенты Цикл
			СообщитьИзМодуля ("Нужно заполнить реквизит ВЕДУЩИЙ у "+РезультатКонтрагенты.Контрагент);
		КонецЦикла;
        //Тимофеев Ю.А 24.10.2023
		
//крохин начало 23.10.2023		
		//для московского филиала непонятно, чем заполнять. Временно убрал запрет		
//		Отказ = Истина;
//крохин конец 23.10.2023

	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////////////////////////
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТЗ.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ВТ_ТаблицаДанных
	|ИЗ
	|	&ТЗ КАК ТЗ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(ВТ_ТаблицаДанных.Контрагент, Контрагенты.Ссылка) КАК Контрагент
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаДанных КАК ВТ_ТаблицаДанных
	|		ПО Контрагенты.Ссылка = ВТ_ТаблицаДанных.Контрагент
	|ГДЕ
	|	Контрагенты.Ведущий.ВыгружатьВИнтернетМагазин = ЗНАЧЕНИЕ(Перечисление.ВыгружатьНаСайт.Да)
	|";
	
	УстановитьПривилегированныйРежим(Истина);
	РезультатКонтрагенты = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Если РезультатКонтрагенты.Количество() > 0 Тогда
		
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ТЗ_Скидки.Номенклатура КАК Номенклатура,
		|	ТЗ_Скидки.СкидкаКонечныйПокупатель КАК СкидкаКонечныйПокупатель
		|ПОМЕСТИТЬ тзСкидки
		|ИЗ
		|	&ТЗ_Скидки КАК ТЗ_Скидки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	тзСкидки.Номенклатура КАК Номенклатура,
		|	тзСкидки.СкидкаКонечныйПокупатель КАК СкидкаКонечныйПокупатель
		|ИЗ
		|	тзСкидки КАК тзСкидки
		|ГДЕ
		|	тзСкидки.СкидкаКонечныйПокупатель = 0";
		
		УстановитьПривилегированныйРежим(Истина);
		РезультатСкидки = Запрос.Выполнить().Выгрузить();
		УстановитьПривилегированныйРежим(Ложь);
		
		Если РезультатСкидки.Количество() > 0 Тогда
			//крохин начало 05.06.2024
			//для новинок возможны нулевые значения скидок для вторичных контрагентов
			//СообщитьИзМодуля("Розничная скидка должна быть заполнена во всех строках (> 0)");
			//Отказ = Истина;
			СообщитьИзМодуля("Розничная скидка должна быть заполнена во всех строках (> 0), за исключением ГС на новинки! ");
			//крохин конец 05.06.2024
		КонецЕсли;
		
	КонецЕсли;
	
	//////////////////////////////////////////////////////////////////////////////////////////////////
	// Шворобей ВЮ 16.10.2023 ++
	
	// для сайта б2б
	// нечаева 14,03,2023+++
	Если ЕстьИзменения Тогда
		// для каждого контрагента, с галкой "выгружать на сайт" прописываем в план обмена, чтобы выгрузились скидки.
		Для каждого текстрока из этотобъект.Контрагенты цикл
			
			Если текстрока.Согласован ТОгда
				
				Контрагент = текстрока.Контрагент;
				ВыгружатьНаСайт = ложь;
				Если Контрагент.ведущий.выгружатьвинтернетмагазин = перечисления.ВыгружатьНаСайт.Да или Контрагент.выгружатьвинтернетмагазин = перечисления.ВыгружатьНаСайт.Да ТОгда
					выгружатьНаСайт=Истина;
				КонецЕсли;	
						
				
				Если ВыгружатьНаСайт Тогда // пропишем ведущего
					ПроцедурыОбменаССайтом.ПриЗаписиСправочникаОбменССайтомПриЗаписи(Контрагент.Ведущий,Отказ);
					// нечаева 12,04,23+++
					ПроцедурыОбменаССайтом.ПриЗаписиСправочникаОбменССайтомПриЗаписи(Контрагент,Отказ);
					// нечаева 12,04,23---
				КонецЕсли;								
			КонецЕсли;			
		конецЦикла;	
		
		// Смирнов М.Ю. 18.06.2025 WEB-3352 начало
		ВыгружатьНаСайт = Ложь;
		Для Каждого ТекСтрока Из ЭтотОбъект.Контрагенты Цикл
			Контрагент = ТекСтрока.Контрагент;
			Если Контрагент.Ведущий.ВыгружатьВИнтернетМагазин = Перечисления.ВыгружатьНаСайт.Да 
				Или Контрагент.ВыгружатьВИнтернетМагазин = Перечисления.ВыгружатьНаСайт.Да Тогда
				ВыгружатьНаСайт = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		//++Данилова Е.В. 23.07.2025  HELP-6121
		ВыгружатьНаСайтb2b_Общ = ВыгружатьНаСайт; 
		//сразу будут передаваться изменения на портал
		//Если ВыгружатьНаСайт Тогда
		//	ПроцедурыОбменаССайтом.ПриЗаписиДокументаОбменССайтомПриЗаписи(Ссылка, Отказ);
		//КонецЕсли;
		// Смирнов М.Ю. 18.06.2025 WEB-3352 конец
		//--Данилова Е.В. 23.07.2025
		
	КонецЕсли;
	// нечаева 14,03,2023--- 
	//++Данилова Е.В. 23.07.2025  HELP-6121
	Если ВыгружатьНаСайтb2b_Общ  = Истина
		И НЕ Отказ Тогда
		
		ИдентификаторФЗПоАкции = Новый УникальныйИдентификатор; 
		b2b_ОбменДаннымиПоAPI.ЗапуститьВФонеОтправкуАкцииНаПорталb2b(ВерсияДанных,ссылка,ИдентификаторФЗПоАкции);	
		
	КонецЕсли;   
	//--Данилова Е.В. 23.07.2025

	
КонецПроцедуры

Процедура ПриЗаписи(Отказ) 
	
	//++Данилова Е.В. 24.07.2025 HELP-6121 
	Если Отказ 
		И ВыгружатьНаСайтb2b_Общ = Истина 
		И ЗначениеЗаполнено(ИдентификаторФЗПоАкции) Тогда
		
		ФЗ = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторФЗПоАкции);
		Если ФЗ <> неопределено Тогда
			
			ФЗ.Отменить();	
			
		КонецЕсли;
		
	КонецЕсли;
	//--Данилова Е.В. 24.07.2025
	
			
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения) Экспорт
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	ТЗНоменклатуры = Новый ТаблицаЗначений;
	ТЗНоменклатуры.Колонки.Добавить("Номенклатура");
	ТЗНоменклатуры.Колонки.Добавить("Скидка");
	ТЗНоменклатуры.Колонки.Добавить("ТипЦен");
	
	Для Каждого СтрокаТЧ Из Скидки Цикл
		ЗапросТовары = Новый Запрос;
		ЗапросТовары.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура.Родитель КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ЭтоГруппа
		|	И Номенклатура.Ссылка В ИЕРАРХИИ(&Номенклатура)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура
		|АВТОУПОРЯДОЧИВАНИЕ";
		ЗапросТовары.УстановитьПараметр("Номенклатура",СтрокаТЧ.Номенклатура);
		Выборка = ЗапросТовары.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			НоваяСтрокаТЗНоменклатуры = ТЗНоменклатуры.Добавить();
			НоваяСтрокаТЗНоменклатуры.Номенклатура = Выборка.Номенклатура;
			НоваяСтрокаТЗНоменклатуры.Скидка = СтрокаТЧ.Скидка;
			НоваяСтрокаТЗНоменклатуры.ТипЦен = СтрокаТЧ.ТипЦен;
		КонецЦикла;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Контрагенты.Контрагент КАК Контрагент,
	|	МАКСИМУМ(Контрагенты.Контрагент.Ведущий.ВыгружатьВИнтернетМагазин) КАК ВыгружатьВИнтернетМагазин,
	|	МАКСИМУМ(Контрагенты.Согласован) КАК Согласован
	|ИЗ
	|	Документ.УстановкаСкидокПоКонтрагентам.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	Контрагенты.Контрагент";
	
	УстановитьПривилегированныйРежим(Истина);
	ТЧконтрагенты = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	Для Каждого СтрокаТЧКонтрагенты Из ТЧконтрагенты Цикл
		Если НЕ СтрокаТЧКонтрагенты.Согласован И СтрокаТЧКонтрагенты.ВыгружатьВИнтернетМагазин = Перечисления.ВыгружатьНаСайт.Да Тогда
			Продолжить;
		КонецЕсли;
		Для Каждого СтрокаТЧНоменклатура Из ТЗНоменклатуры Цикл
			Если СтрокаТЧНоменклатура.ТипЦен.ЗапретНаИспользованиеВДокументах Тогда 
				Продолжить;
			КонецЕсли;
			
			Запись = Движения.СкидкиНоменклатурыКонтрагентов.Добавить();
			Запись.Документ = Ссылка;
			запись.Период = Дата;
			Запись.Контрагент = СтрокаТЧКонтрагенты.Контрагент;
			Запись.Номенклатура = СтрокаТЧНоменклатура.Номенклатура;
			Запись.Скидка = СтрокаТЧНоменклатура.Скидка;
			Запись.ТипЦен = СтрокаТЧНоменклатура.ТипЦен;
		КонецЦикла;
	КонецЦикла;
	
	Движения.СкидкиНоменклатурыКонтрагентов.Записать();
	
	//++Данилова Е.В. 24.07.2025 HELP-6121 
	Если Отказ 
		И ВыгружатьНаСайтb2b_Общ = Истина 
		И ЗначениеЗаполнено(ИдентификаторФЗПоАкции) Тогда
		
		ФЗ = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторФЗПоАкции); 	
		Если ФЗ <> неопределено Тогда
			
			ФЗ.Отменить();	
			
		КонецЕсли;

	КонецЕсли;
	//--Данилова Е.В. 24.07.2025
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры

//++Данилова Е.В. 23.07.2025  HELP-6121

ВыгружатьНаСайтb2b_Общ  = Ложь; 

//--Данилова Е.В. 23.07.2025
